Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་རང་རང་གི་བསྟན་པ་བཤད་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When the bodhisattvas had given their explanations, they all addressed the crown prince Mañjuśrī:

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའི་གཉིས་སུ་མེད་པར་འཇུག་པ་གང་ཡིན།
en: “Mañjuśrī, what is the bodhisattva’s entrance into nonduality?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī replied,

source: །།ཡང་དེའི་ཚེ་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ཞེས་བྱ་བ་ཞིག་འདུག་སྟེ།
en: At that time, there lived in the great city of Vaiśālī a certain Licchavi, Vimalakīrti by name.

source: སྐྱེས་བུ་དམ་པ་ཁྱེད་ཀུན་གྱིས་ཀྱང་ལེགས་པར་སྨྲས་མོད་ཀྱི་ཁྱེད་ཀྱིས་བཤད་པ་དེ་ཐམས་ཅད་ནི་གཉིས་སོ།
en: “Good sirs, you have all spoken well. Nevertheless, all your explanations are themselves dualistic.

source: །བསྟན་པ་གཅིག་ནི་མ་གཏོགས་ཏེ་བརྗོད་དུ་མེད་པ། སྨྲར་མེད་པ། བཤད་དུ་མེད་པ། བསྒྲག་ཏུ་མེད་པ། བསྟན་དུ་མེད་པར་གདགས་སུ་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: To know no one teaching, to express nothing, to say nothing, to explain nothing, to announce nothing, to indicate nothing, and to designate nothing—that is the entrance into nonduality.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the crown prince Mañjuśrī said to the Licchavi Vimalakīrti,

source: །ཁོ་བོ་ཅག་གིས་ནི་རང་རང་གི་བསྟན་པ་བཤད་ཟིན་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱང་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་བསྟན་པ་ལ་སྤོབས་པར་གྱིས་ཤིག
en: “We have all given our own teachings, noble sir. Now, may you elucidate the teaching of the entrance into the principle of nonduality!”

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ཅང་མི་སྨྲ་བར་གྱུར་ཏོ།
en: Thereupon, the Licchavi Vimalakīrti kept his silence, saying nothing at all.

source: དེ་ལ་ཡི་གེ་དང་། སྒྲ་དང་། རྣམ་པར་རིག་པའི་རྒྱུ་བ་མེད་དོ།
en: Here there is no use for syllables, sounds, and ideas.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོར་ཞུགས་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: When these teachings had been declared, five thousand bodhisattvas entered the door of the Dharma of nonduality and attained tolerance of the birthlessness of things.

source: །།དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྙམ་དུ་བསམས་ཏེ།
en: Thereupon, the venerable Śāriputra thought to himself,

source: གདུགས་ཚོད་ལའང་བབ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ནི་མི་ལྡང་ན་འདི་དག་ཟན་གར་ཟ་སྙམ་མོ།
en: “If these great bodhisattvas do not adjourn before noontime, when are they going to eat?”

source: སེམས་ཅན་གྱི་དོན་བྱ་བ་རྗེས་སུ་དྲན་པ་དང་།
en: and his consciousness of working for the welfare of living beings.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་ཐར་པ་བརྒྱད་པོ་གང་དག་གསུངས་པའི་རྣམ་པར་ཐར་པ་དེ་དག་ལ་གནས་པར་གྱིས་ལ་ཟང་ཟིང་དང་འདྲེས་པའི་རྒྱུད་ཀྱིས་ཆོས་མ་ཉན་ཅིག
en: “Reverend Śāriputra, the Tathāgata has taught the eight liberations. You should concentrate on those liberations, listening to the Dharma with a mind free of preoccupations with material things.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཡུད་ཙམ་ཞིག་སྡོད་ཅིག་དང་།
en: Just wait a minute, reverend Śāriputra,

source: སྔོན་མ་མྱོང་བའི་ཁ་ཟས་ཟ་བར་འགྱུར་རོ།
en: and you will eat such food as you have never before tasted.”

source: སེམས་ཅན་ཐམས་ཅད་གདུལ་བའི་ཕྱིར་ལམ་གྱི་བཞི་མདོ་དང་སུམ་མདོ་ཐམས་ཅད་ནའང་སྣང་ལ་སེམས་ཅན་རྣམས་སྲུང་བའི་ཕྱིར་རྒྱལ་པོའི་བྱ་བ་རྣམས་ལ་ཡང་ཞུགས་པ།
en: To educate living beings, he would appear at crossroads and on street corners, and to protect them he participated in government.

source: ཐེག་པ་དམན་པ་ལ་མོས་པ་ཟློག་ཅིང་ཐེག་པ་ཆེན་པོ་ལ་སེམས་ཅན་རྣམས་ཡང་དག་པར་གཟུད་པའི་ཕྱིར་ཆོས་ཉན་པ་དང་། ཡང་དག་པར་བརྗོད་པ་ཐམས་ཅད་ན་ཡང་སྣང་བ།
en: To turn people away from the individual vehicle and to engage them in the Mahāyāna, he appeared among listeners and teachers of the Dharma.

source: འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བའི་ཕྱིར་རྒན་རབས་དང་། བར་མ་དང་། གཞོན་ནུའི་གྲོགས་སུ་གྱུར་ཅིང་ཆོས་བཞིན་དུ་སྨྲ་བ།
en: In order to be in harmony with people, he associated with elders, with those of middle age, and with the young, yet always spoke in harmony with the Dharma.

source: ཐ་སྙད་ཐམས་ཅད་དུ་འཇུག་ཀྱང་རྙེད་པ་དང་ལོངས་སྤྱོད་ལ་རེ་བ་མེད་པ།
en: He engaged in all sorts of businesses, yet had no interest in profit or possessions.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་ན་བ་ཡང་དག་པར་དགའ་བར་བྱའོ།
en: Thus should a bodhisattva console a sick bodhisattva, in such a way as to make him happy.

source: །དེ་ནས་དེའི་ཚེ་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: Then, the Licchavi Vimalakīrti set himself in such a concentration

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་གསང་སྔགས་དང་བསྟན་བཅོས་ཀྱི་རྣམ་པ་ཤེས་ཀྱང་རྟག་ཏུ་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་མོས་པ།
en: He understood the mundane and transcendental sciences and esoteric practices, yet always took pleasure in the delights of the Dharma.

source: འདུ་འཛི་ཀུན་གྱི་ནང་ན་སྣང་ཡང་ཐམས་ཅད་ཀྱི་ནང་ན་གཙོ་བོར་མཆོད་པ།
en: He mixed in all crowds, yet was respected as foremost of all.

source: །ལུས་འདི་ལ་བདག་མེད་དེ།
en: There is no self in this body,

source: བདག་ཏུ་མངོན་པར་ཞེན་པ་མ་གཏོགས་པར་འདི་ལ་དོན་དམ་པར་ན་གང་ནད་ཅེས་བྱ་བ་དེ་མི་དམིགས་ཏེ།
en: and, except for arbitrary insistence on self, ultimately no ‘I’ which can be said to be sick can be apprehended.

source: དེ་བས་ན་བདག་ནི་མངོན་པར་ཞེན་པ་མེད་ཅིང་། ནད་ཀྱི་རྩ་བ་ཀུན་ཤེས་པ་ལ་གནས་པར་བྱའོ།
en: Therefore, thinking, ‘ “I” should not adhere to any self, and “I” should rest in the knowledge of the root of illness,’

source: རྒྱན་གྱིས་བརྒྱན་པར་སྣང་ཡང་རྟག་ཏུ་མཚན་དང་ལྡན་པ།
en: He appeared to be adorned with ornaments, yet always was endowed with the auspicious signs and marks.

source: ཟས་སྐོམ་གྱི་ཟས་ཟ་བར་སྣང་བ་ཡང་རྟག་ཏུ་བསམ་གཏན་གྱི་དགའ་བའི་ཟས་ཟ་བ།
en: He seemed to eat and drink, yet always took nourishment from the taste of meditation.

source: ཡ་མཚན་ཅན་ཐམས་ཅད་ཚོལ་ཡང་སངས་རྒྱས་ལ་མི་ཕྱེད་པའི་བསམ་པ་དང་ལྡན་པ།
en: He visited the fashionable outsider teachers, yet always kept unswerving loyalty to the Buddha.

source: རྩེད་མོ་དང་། རྒྱན་པོའི་གྲྭ་ཐམས་ཅད་ན་སྣང་ཡང་རྩེད་མོ་དང་རྒྱན་པོ་ལ་ཆགས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་རྟག་ཏུ་དོན་ཡོད་པར་སྤྱོད་པ།
en: He made his appearance at the fields of sports and in the casinos, but his aim was always to mature those people who were attached to games and gambling.

source: བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་གི་ཚོགས་འདུས་པ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པ་དེ་ཆོས་སྟོན་ཏོ།
en: and the Tathāgata Gandhottama­kūṭa teaches the Dharma to a gathering of bodhisattvas only.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་མིང་ཡང་མེད་དེ།
en: In that universe, even the names “disciple” and “solitary sage” do not exist,

source: སེམས་ཅན་འཆལ་པའི་ཤེས་རབ་ཅན་རྣམས་བསྡུ་བའི་ཕྱིར་ཤེས་རབ་རྣམ་པར་ངེས་པ་ཐོབ་པ།
en: He attained decisive wisdom in order to sustain the foolish.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེར་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་མི་དང་ལྷའི་དྲིའི་བྱུང་བ་དེ་བས་འཇིག་རྟེན་གྱི་ཁམས་དེའི་ཤིང་ལས་ཆེས་ཁྱད་དུ་འཕགས་པ་འབྱུང་ངོ་།
en: In that universe, the trees emit a fragrance that far surpasses all the fragrances, human and divine, of all the buddhafields of the ten directions.

source: གོས་དཀར་པོ་གྱོན་ལ་དགེ་སྦྱོང་གི་སྤྱོད་པས་ཕུན་སུམ་ཚོགས་པ།
en: He wore the white clothes of the layman, yet lived impeccably like a religious devotee.

source: སེམས་ཅན་ལེ་ལོ་ཅན་རྣམས་བསྡུ་བའི་ཕྱིར་བརྩོན་འགྲུས་འབར་བ།
en: He blazed with energy in order to inspire people who were lazy.

source: །དེ་ན་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ།
en: There the tathāgata named Gandhottama­kūṭa resides, lives, and is manifest.

source: འདི་འདྲ་བའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུས་བྱས་སོ། །གང་སྟེང་གི་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་དྲི་མཆོག་ཅེས་བྱ་བ་ཡོད་དེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་ལ་བསྟན་ཏོ།
en: and performed such a miraculous feat that those bodhisattvas and those great disciples were enabled to see the universe called Sarva­gandha­sugandhā, which is located in the direction of the zenith, beyond as many buddhafields as there are sands in forty-two Ganges rivers.

source: སེམས་འཁྲུག་པའི་སེམས་ཅན་རྣམས་བསྡུ་བའི་ཕྱིར་བསམ་གཏན་དང་། དྲན་པ་དང་། ཏིང་ངེ་འཛིན་ལ་གནས་པ།
en: He maintained concentration, mindfulness, and meditation in order to sustain the mentally troubled.

source: །གང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཟས་ཟ་བའི་ཟས་དེའི་དྲིས་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་ཁྱབ་བོ།
en: and the fragrance of the food eaten by those bodhisattvas pervades immeasurable universes.

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Licchavi Vimalakīrti addressed that incarnated bodhisattva:

source: གང་གིས་འཁོར་དེ་དག་ཐམས་ཅད་མོག་མོག་པོར་བྱས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གཟུགས་སུ་སྣང་བར་གྱུར་ཏོ།
en: adorned with the auspicious signs and marks, and of such an appearance that he outshone the whole assembly.

source: དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་མལ་དེ་ནས་མ་ལངས་པར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་མདུན་དུ་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལེགས་པར་བརྒྱན་པ་ཞིག་སྤྲུལ་ཏེ།
en: Then, the Licchavi Vimalakīrti, without rising from his couch, magically emanated an incarnated bodhisattva, whose body was of golden color,

source: །རིགས་ཀྱི་བུ་ཁྱོད་སྟེང་གི་ཕྱོགས་སུ་སོང་ལ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་དྲི་མཆོག་ཅེས་བྱ་བ་ཡོད་དེ།
en: “Noble son, go in the direction of the zenith and when you have crossed as many buddhafields as there are sands in forty-two Ganges rivers, you will reach a universe called Sarva­gandha­sugandhā,

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་མ་བསླབས་པ་ལ་བརྙས་པར་མི་བྱའོ་ཞེས་མ་གསུངས་སམ།
en: “Noble sir, did not the Tathāgata declare, ‘Those who are unlearned should not be despised’?”

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Licchavi Vimalakīrti said to the crown prince Mañjuśrī,

source: །འཇམ་དཔལ་ཁྱོད་ཀྱི་འཁོར་འདི་འདྲ་ལ་ངོ་མི་ཚའམ།
en: “Mañjuśrī, are you not ashamed of such a gathering?”

source: དེ་ན་འཇམ་དཔལ་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་སུ་ཡང་སྤྲོ་བ་མེད་དོ།
en: But, restrained by the supernatural power of Mañjuśrī, none of them volunteered to go.

source: །སྐྱེས་བུ་དམ་པ་ཁྱེད་ཀྱི་ནང་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་ཟས་ལེན་པར་སུ་སྤྲོ།
en: “Good sirs, is there any among you who would like to go to that buddhafield to bring back some food?”

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Licchavi Vimalakīrti addressed the whole gathering of bodhisattvas:

source: །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བཅོམ་ལྡན་འདས་དེ་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བཤོས་ལ་བཀོད་དེ་བཞུགས་པ་མཐོང་ངོ་།
en: Everyone in the gathering at the house of Vimalakīrti was able to see distinctly this universe wherein the Tathāgata Gandhottama­kūṭa and his bodhisattvas were taking their meal.

source: དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཅིག
en: having bowed down at his feet, make the following inquiry of him:

source: དེས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་པར་འགྱུར་རོ།
en: with which he will accomplish the buddha-work in the universe called Sahā.

source: །དམན་པ་ལ་མོས་པའི་སེམས་ཅན་འདི་དག་ཀྱང་རྒྱ་ཆེན་པོ་ལ་དད་པར་བགྱིད་པར་འགྱུར་རོ།
en: Thus, those living beings with inferior aspirations will be inspired with lofty aspirations,

source: །དེ་བཞིན་གཤེགས་པའི་མཚན་ཀྱང་རྒྱས་པར་བགྱིད་པར་འགྱུར་རོ།
en: and the good name of the Tathāgata will be celebrated far and wide.’ ”

source: །དེ་ནས་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་ལེགས་སོ་ཞེས་བྱས་ནས་དེ་མཉན་ཏེ།
en: the incarnated bodhisattva said, “Very good!” to the Licchavi Vimalakīrti and obeyed his instructions.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་མདུན་ནས་བཞིན་གྱེན་དུ་བལྟས་ཏེ་སོང་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་དེ་འགྲོ་བར་མ་མཐོང་ངོ་།
en: In sight of all the bodhisattvas, he turned his face upward and was gone, and they saw him no more.

source: །བཅོམ་ལྡན་འདས་གསོལ་བའི་ཞལ་ཟས་ཀྱི་ཕམ་ཕབས་བདག་ལ་སྩལ་བར་གསོལ། དེས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་པར་འགྱུར་རོ།
en: ‘May the Lord be gracious and give to me the remains of his meal in order to accomplish the buddha-work in the universe called Sahā.

source: །དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ལན་བརྒྱ་སྟོང་དུ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: having bowed down one hundred thousand times at the feet of the Lord:

source: བྱིས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡི་གེའི་གྲྭ་ཁང་ཐམས་ཅད་དུའང་འགྲོ་བ།
en: To develop children, he visited all the schools.

source: འདོད་པའི་ཉེས་པ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་སྨད་འཚོང་གི་ཁྱིམ་ཀུན་དུའང་འཇུག་པ།
en: To demonstrate the evils of desire, he even entered the brothels.

source: །དེ་ནས་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་དྲི་མཆོག་ཅེས་བྱ་བ་དེར་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When he reached the universe Sarva­gandha­sugandhā, he bowed down at the feet of the Tathāgata Gandhottama­kūṭa and said,

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མ་མེད་པར་གྲགས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་འམ། སྟོབས་དང་། བདེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་མི་མངའ་ཞིང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་སྙུན་གསོལ་ལོ།
en: “Lord, the bodhisattva Vimalakīrti, bowing down at the feet of the Lord, greets the Lord, saying: ‘Do you have little trouble, little discomfort, and little unrest? Are you strong, well, without complaint, and living in touch with the supreme happiness?’ He then requests,

source: དྲན་པ་ཡང་དག་པར་གཞག་པའི་ཕྱིར་ཆང་འཚོང་བའི་ཁྱིམ་ཐམས་ཅད་དུའང་འཇུག་པ།
en: To establish drunkards in correct mindfulness, he entered all the drinking-houses.

source: ཆོས་ཀྱི་མཆོག་བསྟན་པའི་ཕྱིར་ཚོང་དཔོན་གྱི་ནང་དུ་ཡང་ཚོང་དཔོན་དུ་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the merchant among merchants because he demonstrated the priority of the Dharma.

source: འཛིན་པ་ཐམས་ཅད་ཀྱི་ལེན་པ་ཡོངས་སུ་གཅད་པའི་ཕྱིར་ཁྱིམ་བདག་གི་ནང་དུའང་ཁྱིམ་བདག་ཏུ་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the landlord among landlords because he renounced the aggressiveness of ownership.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པས་དྲི་ཐམས་ཅད་དང་ལྡན་པའི་སྣོད་དུ་དྲི་ཐམས་ཅད་བསྒོས་པའི་ཟས་བླུགས་ཏེ།
en: Then, the Tathāgata Gandhottama­kūṭa poured some of his food, impregnated with all perfumes, into a fragrant vessel

source: བཟོད་པ་དང་དེས་པ་དང་། སྟོབས་ལ་རབ་ཏུ་དགོད་པའི་ཕྱིར་རྒྱལ་རིགས་ཀྱི་ནང་དུ་ཡང་རྒྱལ་རིགས་སུ་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the warrior among warriors because he cultivated endurance, determination, and fortitude.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་ཤིན་ཏུ་གཞོམ་པའི་ཕྱིར་བྲམ་ཟེའི་ནང་དུ་ཡང་བྲམ་ཟེར་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the brahmin among brahmins because he suppressed pride, vanity, and arrogance.

source: རྒྱལ་པོའི་བྱ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པར་བསྒོ་བའི་ཕྱིར་བློན་པོའི་ནང་དུ་ཡང་བློན་པོར་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the official among officials because he regulated the functions of government according to the Dharma.

source: རྒྱལ་པོའི་ལོངས་སྤྱོད་དང་དབང་ཕྱུག་ལ་ཆགས་པ་བཟློག་པའི་ཕྱིར་གཞོན་ནུའི་ནང་དུ་ཡང་གཞོན་ནུར་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the prince of princes because he reversed their attachment to royal pleasures and sovereign power.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཆེ་བ་ནི་འདི་འདྲ་སྟེ། དེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སྤྲུལ་པ་འགྱེད་དེ། སྤྲུལ་པ་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གི་སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་བྱ་བས་ཉེ་བར་གནས་པར་འགྱུར་རོ།
en: “The greatness of that bodhisattva is such that he sends magical incarnations to all the buddhafields of the ten directions, and all these incarnations accomplish the buddha-work for all the living beings in all those buddhafields.”

source: བུད་མེད་གཞོན་ནུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་ཡང་ཉུང་རུམ་དུ་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as a chamberlain in the royal harem because he brought the young ladies to spiritual maturity.

source: ཐ་མལ་བའི་བསོད་ནམས་ཁྱད་པར་དུ་འཕགས་པར་དམིགས་པར་བྱ་བའི་ཕྱིར་སྐྱེ་བོ་ཕལ་པ་དང་ཡང་འཐུན་པར་འཇུག་པ།
en: He was compatible with ordinary people because he appreciated the excellence of ordinary merits.

source: དབང་ཕྱུག་གི་བདག་པོར་བསྟན་པའི་ཕྱིར་བརྒྱ་བྱིན་གྱི་ནང་དུ་ཡང་བརྒྱ་བྱིན་དུ་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the Indra among Indras because he showed them the temporality of their lordship.

source: ཡེ་ཤེས་ཀྱི་ཁྱད་པར་བསྟན་པའི་ཕྱིར་ཚངས་པའི་ནང་དུའང་ཚངས་པར་ཀུན་གྱིས་བཀུར་བ།
en: He was honored as the Brahmā among Brahmās because he showed them the special excellence of gnosis.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་སྐྱོང་བའི་ནང་དུ་ཡང་འཇིག་རྟེན་སྐྱོང་བར་ཀུན་གྱིས་བཀུར་བ་སྟེ།
en: He was honored as the Lokapāla among Lokapālas because he fostered the development of all living beings.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattvas exclaimed,

source: དེ་ལྟར་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ཚད་མེད་པའི་ཐབས་ལ་མཁས་པའི་ཡེ་ཤེས་དང་ལྡན་ཏེ། ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན་གནས་ཤིང་འདུག་གོ།
en: Thus lived the Licchavi Vimalakīrti in the great city of Vaiśālī, endowed with an infinite knowledge of skill in liberative arts.

source: དེས་ངའི་མིང་ཡོངས་སུ་བསྒྲགས་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བསྔགས་པ་རབ་ཏུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་འབར་བར་བྱ་བའི་ཕྱིར་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བཏང་ངོ་།
en: He sends this incarnated bodhisattva here in order to celebrate my name, in order to show the advantages of this universe, and in order to increase the roots of virtue of those bodhisattvas.”

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲི་མ་མེད་པར་གྲགས་པ་ཞེས་བྱ་བ་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པ་དེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: There the bodhisattva Vimalakīrti, who lives in the inconceivable liberation, teaches the Dharma to the bodhisattvas.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་སྙིགས་མ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་དམན་པ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: There the Tathāgata Śākyamuni teaches the Dharma to living beings who aspire to inferior ways, in that buddhafield tainted with five corruptions.

source: །ལུས་འདི་ནི་རྩྭ་དང་། ཤིང་དང་། རྩིག་པ་དང་། བོང་བ་དང་། མིག་ཡོར་ལྟ་བུ་སྟེ་བེམས་པོའོ།
en: It is inanimate, being like grass, trees, walls, clods of earth, and illusions.

source: །ལུས་འདི་ནི་བདག་དང་བདག་གི་མེད་པ་སྟེ་སྟོང་པའོ།
en: It is void, not existing as self or as self-possessed.

source: །ལུས་འདི་ནི་འབྱུང་བ་ཆེན་པོ་རྣམས་ཀྱི་གནས་ཏེ་ཡང་དག་པ་མ་ཡིན་པའོ།
en: This body is unreal, being a collocation of the four main elements.

source: །ལུས་འདི་ནི་རྐྱེན་སྣ་ཚོགས་ལས་བྱུང་བ་སྟེ་བདག་པོ་མེད་པའོ།
en: The body is ownerless, being the product of a variety of conditions.

source: །ཀྱེ་མ་ལུས་འདི་ནི་རུས་པ་ལ་རྒྱུས་པས་སྦྲེལ་བ་སྟེ་འཁྲུལ་འཁོར་ལྟ་བུའོ།
en: Alas! This body is like a machine, a nexus of bones and tendons.

source: །ནད་ནི་སྔོན་གྱི་མཐའ་ནས་ཡོད་པ་མ་ཡིན་པ་ཕྱིན་ཅི་ལོག་གི་ལས་ཀུན་ནས་ལྡང་བ་ལས་བྱུང་ངོ་།
en: Sickness arises from total involvement in the process of misunderstanding from beginningless time.

source: །ལུས་འདི་ནི་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ་སྟེ་སྒྱུ་མ་ལྟ་བུའོ།
en: It is like a magical illusion, consisting of falsifications.

source: །ལུས་འདི་ནི་ཡང་དག་པ་མ་ཡིན་པ་མཐོང་བ་སྟེ་རྨི་ལམ་ལྟ་བུའོ།
en: It is like a dream, being an unreal vision.

source: །ལུས་འདི་ནི་སྔོན་གྱི་ལས་ཀྱིས་གཟུགས་བརྙན་སྣང་བ་སྟེ་གཟུགས་བརྙན་ལྟ་བུའོ།
en: It is like a reflection, being the image of former actions.

source: །ལུས་འདི་ནི་རྐྱེན་ལ་རག་ལུས་པའི་ཕྱིར་བྲག་ཅ་ལྟ་བུའོ།
en: It is like an echo, being dependent on conditioning.

source: །ཡང་དག་པ་མ་ཡིན་པ་ཀུན་ཏུ་རྟོག་པའི་ཉོན་མོངས་པ་ལས་བྱུང་སྟེ། དོན་དམ་པར་ནི་འདི་ལ་གང་གི་ན་བ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་མི་དམིགས་སོ།
en: It arises from the afflictions that result from unreal mental constructions, and hence ultimately nothing is perceived which can be said to be sick.

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེ་གང་ན་མཆིས།
en: Where is the universe Sahā?

source: །ལུས་འདི་ནི་ཆོས་མང་པོ་འདུས་པ་སྟེ་སྐྱེ་བ་ན་ཡང་ཆོས་ཁོ་ན་སྐྱེ།
en: ‘This body is an aggregate of many things. When it is born, only things are born;

source: །ལུས་འདི་ནི་སེམས་འཁྲུག་ཅིང་འགྱེས་པའི་མཚན་ཉིད་དེ་སྤྲིན་ལྟ་བུའོ།
en: It is like a cloud, being characterized by turbulence and dissolution.

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་ཆེན་པོ་འདི་ལྟ་བུ་ག་ལ་མཆིས།
en: “Lord, where is there such a great being as this?

source: །ལུས་འདི་ནི་སྐད་ཅིག་ཏུ་འཇིག་པ་དང་ལྡན་ཞིང་མི་གནས་པ་སྟེ་གློག་དང་མཚུངས་སོ།
en: It is like a flash of lightning, being unstable, and decaying every moment.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that the bodhisattvas of the buddhafield of the Tathāgata Gandhottama­kūṭa were astonished and asked the Tathāgata Gandhottama­kūṭa,

source: འགག་པ་ན་ཡང་ཆོས་ཁོ་ན་འགག་སྟེ། ཆོས་དེ་དག་ནི་ཕན་ཚུན་དུ་མི་ཚོར་མི་ཤེས་ཏེ།
en: when it ceases, only things cease. These things have no awareness or feeling of each other.

source: དེ་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་བྱིན་ནོ།
en: and gave it to the incarnated bodhisattva.

source: །ལུས་འདི་ནི་སྙིང་པོ་མེད་པ་སྟེ་ཆུ་ཤིང་གི་སྡོང་པོ་ལྟ་བུའོ།
en: It is like the trunk of the plantain tree, having no core.

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་ཡང་དེར་འགྲོ་བར་ཆས་ཏེ།
en: And the ninety million bodhisattvas of that universe volunteered to go along with him:

source: །ལུས་འདི་ནི་ཉོན་མོངས་པའི་སྲེད་པ་ལས་བྱུང་བ་སྟེ། སྨིག་རྒྱུ་ལྟ་བུའོ།
en: It is like a mirage, born from the appetites of the passions.

source: །ལུས་འདི་ནི་རིང་དུ་མི་གནས་པ་སྟེ། ཆུའི་ཆུ་བུར་ལྟ་བུའོ།
en: It is like a water bubble, not remaining very long.

source: །གྲོགས་པོ་དག་ལུས་འདི་ནི་བཅང་མི་བཟོད་པ་སྟེ། དབུ་བ་རྡོས་པ་ལྟ་བུའོ།
en: This body is like a ball of foam, unable to bear any pressure.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། དྲི་མ་མེད་པར་གྲགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་བལྟ་བའི་སླད་དུ་མཆིའོ།
en: “Lord, we also would like to go to that universe Sahā, to see, honor, and serve the Buddha Śākyamuni and to see Vimalakīrti and those bodhisattvas.”

source: །གྲོགས་པོ་དག་འདི་ལྟར་ལུས་འདི་ནི་ནད་མང་པོའི་སྣོད་དེ། མཁས་པས་དེ་ལ་གནས་པར་མི་བྱའོ།
en: Thus, my friends, as this body is only a vessel of many sicknesses, wise men do not rely on it.

source: །བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ།
en: The Tathāgata declared,

source: གྲོགས་པོ་དག་ལུས་འདི་ནི་འདི་ལྟར་མི་རྟག་པ། འདི་ལྟར་མི་བརྟན་པ། འདི་ལྟར་ཡིད་བརྟན་དུ་མི་རུང་བ། འདི་ལྟར་ཉམ་ཆུང་བ།
en: “Friends, this body is so impermanent, fragile, unworthy of confidence, and feeble.

source: འདི་ལྟར་སྙིང་པོ་མེད་པ། འདི་ལྟར་ཞིག་པ། འདི་ལྟར་ཡུན་ཐུང་བ། འདི་ལྟར་སྡུག་བསྔལ་བ། འདི་ལྟར་ནད་མང་བ། འདི་ལྟར་འགྱུར་བའི་ཆོས་ཅན་ནོ།
en: It is so insubstantial, perishable, short-lived, painful, filled with diseases, and subject to changes.

source: དེར་ལྷགས་པ་དེ་དག་ལ་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འབྱུང་བ་ཆེན་པོ་བཞིའི་ལུས་འདི་ཉིད་ལས་བརྩམས་ནས་ཆོས་སྟོན་ཏེ།
en: When they arrived, Vimalakīrti taught them the Dharma, beginning his discourse from the actuality of the four main elements:

source: ། ལུས་འདི་ནི་རླུང་གི་འཁྲུལ་འཁོར་དང་ལྡན་པས་འབྱུང་སྟེ་ཚོར་བ་མེད་པའོ།
en: It is insensate, being driven like a windmill.

source: །ལུས་འདི་ནི་རྣག་དང་མི་གཙང་བ་བསགས་པ་སྟེ་གསོག་གོ།
en: It is filthy, being an agglomeration of pus and excrement.

source: །ལུས་འདི་ནི་རྟག་ཏུ་བསྐུ་བ་དང་། མཉེ་བ་དང་། འཇིག་པ་དང་། འགྱེས་པའི་ཆོས་ཅན་ཏེ་གསོབ་བོ།
en: It is false, being fated to be broken and destroyed, in spite of being anointed and massaged.

source: །ལུས་འདི་ནི་ནད་བཞི་བརྒྱ་རྩ་བཞིས་གཙེས་པའོ།
en: It is afflicted by the four hundred and four diseases.

source: །ལུས་འདི་ནི་རྟག་ཏུ་རྒ་བས་ཟིལ་གྱིས་ནོན་པ་སྟེ་ཁྲོན་པ་རྙིང་པ་དང་འདྲ་བའོ།
en: It is like an ancient well, constantly overwhelmed by old age.

source: །ལུས་འདི་ནི་འཆི་བའི་མཐའ་ཡིན་ཏེ་མཐར་མི་གནས་པའོ།
en: Its duration is never certain—certain only is its end in death.
